offline/OpenFOAM/incompressible/simpleFoam/windAroundBuildings/system/blockMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

scale           1;

vertices        ( ( -20 -50 0 ) ( 330 -50 0 ) ( 330 230 0 ) ( -20 230 0 ) ( -20 -50 140 ) ( 330 -50 140 ) ( 330 230 140 ) ( -20 230 140 ) );

blocks          ( hex ( 0 1 2 3 4 5 6 7 ) ( 25 20 10 ) simpleGrading ( 1 1 1 ) );

edges           ( );

boundary        ( inlet { type patch ; faces ( ( 0 3 7 4 ) ) ; } outlet { type patch ; faces ( ( 1 5 6 2 ) ) ; } ground { type wall ; faces ( ( 0 1 2 3 ) ) ; } frontAndBack { type symmetry ; faces ( ( 0 4 5 1 ) ( 3 2 6 7 ) ( 4 7 6 5 ) ) ; } );

mergePatchPairs ( );
